# PANDAS ASSIGNMENT

***

### Qn.1. How-to-count-the-distance-to-the-previous-zero

#### For each value, count the difference of the distance from the previous zero(or the start of the Series, whichever is closer) and if there are no previous zeros, print the position
#### Consider a DataFrame df where there is an integer column{'X':[7,2,0,3,4,2,5,0,3,4]}
#### The values should therefore be [1,2,0,1,2,3,4,0,1,2]. Make this a new column 'Y'/

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4]})

In [3]:
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [4]:
#Counting the distance to the previous zero

X=[7,2,0,3,4,2,5,0,3,4]

count=1
Y=[]
for items in X:
    if items==0:
        count=0
    
    Y.append(count)
    count+=1
print('Y = ',Y)

Y =  [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

In [5]:
df=pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4],'Y':[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]})

In [6]:
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

### Qn.2. Create a Datetimeindex that contains each business day of 2015 and use it to index a Series of random numbers

In [7]:
DtIndex = pd.date_range('2015-01-01', '2015-12-31',freq='B')  #freq='B' stands for 'Business day' starting from 1st Jan to 31st Dec of 2015

In [8]:
DtIndex

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-05', '2015-01-06',
               '2015-01-07', '2015-01-08', '2015-01-09', '2015-01-12',
               '2015-01-13', '2015-01-14',
               ...
               '2015-12-18', '2015-12-21', '2015-12-22', '2015-12-23',
               '2015-12-24', '2015-12-25', '2015-12-28', '2015-12-29',
               '2015-12-30', '2015-12-31'],
              dtype='datetime64[ns]', length=261, freq='B')

In [9]:
#making s as the series of random numbers and using my DtIndex to index s

In [10]:
s=pd.Series(np.random.rand(261),index=DtIndex)

In [11]:
s                  #created a DatetimeIndex that contains each businessday of 2015 and that has been used to index to a series of random numbers

2015-01-01    0.592545
2015-01-02    0.477504
2015-01-05    0.774456
2015-01-06    0.062946
2015-01-07    0.091310
2015-01-08    0.977353
2015-01-09    0.071827
2015-01-12    0.202611
2015-01-13    0.167666
2015-01-14    0.670557
2015-01-15    0.778632
2015-01-16    0.848541
2015-01-19    0.277358
2015-01-20    0.380669
2015-01-21    0.387664
2015-01-22    0.724040
2015-01-23    0.236985
2015-01-26    0.006212
2015-01-27    0.443362
2015-01-28    0.391782
2015-01-29    0.717129
2015-01-30    0.694115
2015-02-02    0.838243
2015-02-03    0.309887
2015-02-04    0.771524
2015-02-05    0.828825
2015-02-06    0.178979
2015-02-09    0.751172
2015-02-10    0.113510
2015-02-11    0.978217
                ...
2015-11-20    0.129700
2015-11-23    0.585385
2015-11-24    0.497016
2015-11-25    0.339652
2015-11-26    0.509975
2015-11-27    0.799932
2015-11-30    0.345849
2015-12-01    0.270221
2015-12-02    0.456603
2015-12-03    0.812690
2015-12-04    0.585310
2015-12-07    0.726221
2015-12-08    0.587969
2015-12-09    0.376723
2015-12-10    0.019384
2015-12-11    0.087903
2015-12-14    0.434395
2015-12-15    0.469515
2015-12-16    0.807621
2015-12-17    0.126345
2015-12-18    0.554774
2015-12-21    0.697850
2015-12-22    0.425952
2015-12-23    0.087017
2015-12-24    0.131475
2015-12-25    0.470830
2015-12-28    0.387326
2015-12-29    0.269824
2015-12-30    0.701444
2015-12-31    0.582955
Freq: B, Length: 261, dtype: float64

In [12]:
BD = pd.DataFrame(data = s, index= DtIndex)

#Created a dataframe with DtIndex as 'index' and 's' as attribute

In [13]:
BD.columns=['s']        #naming column as 's'

In [14]:
BD.head()

                   s
2015-01-01  0.592545
2015-01-02  0.477504
2015-01-05  0.774456
2015-01-06  0.062946
2015-01-07  0.091310

In [15]:
BD.shape

(261, 1)

### Qn.3 Find the sum of the values in s for every Wednesday

In [16]:
#I have created the dataframe BD with attribute 's'. So taking sum of all wednesdays in 2015 from BD

In [17]:
BD.head()

                   s
2015-01-01  0.592545
2015-01-02  0.477504
2015-01-05  0.774456
2015-01-06  0.062946
2015-01-07  0.091310

In [18]:
BD['Day']=DtIndex.day_name() #creating a column for showing the corresponding days for the date

In [19]:
BD.head(7)

                   s        Day
2015-01-01  0.592545   Thursday
2015-01-02  0.477504     Friday
2015-01-05  0.774456     Monday
2015-01-06  0.062946    Tuesday
2015-01-07  0.091310  Wednesday
2015-01-08  0.977353   Thursday
2015-01-09  0.071827     Friday

In [20]:
BD1=BD.copy() #Copied the data in BD to BD1 to make changes in BD1

In [24]:
BD1=BD1.groupby(['Day']).sum()

In [25]:
BD1

                   s
Day
Friday     23.987742
Monday     26.518362
Thursday   27.643702
Tuesday    25.647243
Wednesday  28.812622

In [26]:
#Another method for finding the sum of s for all Wednesday

In [27]:
BD2=BD.copy()

In [28]:
sum_of_s=BD2[BD2.Day=="Wednesday"].s.sum()

In [29]:
sum_of_s

28.81262177687087

### Qn.3.Average for each calendar month

In [30]:
BD.resample('M').mean() #finding the average for each month in 2015

                   s
2015-01-31  0.453421
2015-02-28  0.573689
2015-03-31  0.555749
2015-04-30  0.458641
2015-05-31  0.539530
2015-06-30  0.530503
2015-07-31  0.534156
2015-08-31  0.518604
2015-09-30  0.604402
2015-10-31  0.395717
2015-11-30  0.504458
2015-12-31  0.437841

### Qn.5. For each group of four consecutive calendar months in s, find the date on which the highest value occurred

In [31]:
BD.head(10)

                   s        Day
2015-01-01  0.592545   Thursday
2015-01-02  0.477504     Friday
2015-01-05  0.774456     Monday
2015-01-06  0.062946    Tuesday
2015-01-07  0.091310  Wednesday
2015-01-08  0.977353   Thursday
2015-01-09  0.071827     Friday
2015-01-12  0.202611     Monday
2015-01-13  0.167666    Tuesday
2015-01-14  0.670557  Wednesday

In [32]:
BD.groupby(pd.Grouper(freq='M')).max()[:4] #finding date on which s was highest for 4 consecutive months

                   s        Day
2015-01-31  0.977353  Wednesday
2015-02-28  0.997430  Wednesday
2015-03-31  0.978361  Wednesday
2015-04-30  0.998011  Wednesday